RedditClone/app/controllers/users_controller.rb

    def destroy
        @user = current_user
        logout!
        @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

    def update
        @user = current_user
        @user.username = user_params[:username]
        @user.save!
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "please poop"], ["updated_at", "2022-12-23 19:46:13.032806"], ["id", 5]]