RedditClone/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = self.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "professor"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-12-23 19:04:29.482611"], ["id", 1]]